tap "heroku/heroku"
tap "unsecretised/tap"
# Mozilla CA certificate store
brew "ca-certificates"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Dotfile manager and templater written in rust
brew "dotter"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Command-line tool to interact with exercism.io
brew "exercism"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# Command-line fuzzy finder written in Go
brew "fzf"
# Google Drive CLI Client
brew "gdrive"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Alias for git commit --fixup <ref>
brew "git-fixup"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Post-modern modal text editor
brew "helix"
# Add GitHub support to git on the command-line
brew "hub"
# YAML Parser
brew "libyaml"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Modern replacement for ps written in Rust
brew "procs"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Check your $HOME for unwanted files and directories
brew "xdg-ninja"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Flexible and fast Zsh plugin manager
brew "zinit"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Everything you need to get started with Heroku
brew "heroku/heroku/heroku"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Time tracker
cask "activitywatch"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Memory training application
cask "anki"
# Universal chat app powered by Matrix
cask "beeper"
# Desktop password and login vault
cask "bitwarden"
# Web browser focusing on privacy
cask "brave-browser@beta"
# Cross-platform Text Expander written in Rust
cask "espanso"
# Web browser
cask "firefox"
# Keyboard-focused todo manager
cask "godspeed"
# Utility to hide menu bar items
cask "hiddenbar"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# System monitoring app
cask "istat-menus"
# Keyboard customiser
cask "karabiner-elements"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Native chat application for all major LLM APIs
cask "macai"
# Music tagger
cask "musicbrainz-picard"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Client for Proton Drive
cask "proton-drive"
# Bridges Proton Mail to email clients supporting IMAP and SMTP protocols
cask "proton-mail-bridge"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Google search for your system
cask "rustcast"
# Instant messaging application focusing on security
cask "signal@beta"
# Team communication and collaboration software
cask "slack"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Gecko based web browser
cask "zen"
# Video communication and virtual meeting platform
cask "zoom"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "jasew.vscode-helix-emulation"
