tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "coreutils"
brew "readline"
brew "asdf"
brew "bat"
brew "broot"
brew "sqlite"
brew "pkg-config"
brew "cmake"
brew "colordiff"
brew "diff-so-fancy"
brew "direnv"
brew "exa"
brew "exercism"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "git-fixup"
brew "gnupg"
brew "imagemagick"
brew "pandoc"
brew "procs"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "tealdeer"
brew "tmux"
brew "tree"
brew "xh"
brew "zoxide"
brew "zsh"
brew "zsh-completions"
cask "1password"
cask "alfred"
cask "anki"
cask "bettertouchtool"
cask "bitwarden"
cask "calibre"
cask "ccmenu"
cask "dash"
cask "dynalist"
cask "firefox"
cask "firefox-developer-edition"
cask "font-meslolg-nerd-font"
cask "freedom"
cask "google-backup-and-sync"
cask "hammerspoon"
cask "hiddenbar"
cask "iterm2"
cask "karabiner-elements"
cask "lulu"
cask "muzzle"
cask "obsidian"
cask "signal"
cask "skype"
cask "slack"
cask "sublime-text"
cask "teamviewer"
cask "ticktick"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
