bgse.relative-path-and-line
bradgashler.htmltagwrap
castwide.solargraph
CoenraadS.bracket-pair-colorizer-2
elmTooling.elm-ls-vscode
esbenp.prettier-vscode
extr0py.vscode-relative-line-numbers
formulahendry.auto-rename-tag
HookyQR.beautify
karunamurti.haml
Lourenci.go-to-spec
misogi.ruby-rubocop
mjmcloug.vscode-elixir
ms-vscode.vscode-typescript-tslint-plugin
ms-vscode.wordcount
ms-vsliveshare.vsliveshare
oderwat.indent-rainbow
olveralan.spunbeat
PKief.material-icon-theme
rebornix.ruby
RescueTime.rescuetime
streetsidesoftware.code-spell-checker
timonwong.shellcheck
wingrunr21.vscode-ruby
wmaurer.vscode-jumpy
