bradgashler.htmltagwrap
castwide.solargraph
dbaeumer.vscode-eslint
donebd.vscode-keypromoter
eamodio.gitlens
esbenp.prettier-vscode
ezforo.copy-relative-path-and-line-numbers
formulahendry.auto-rename-tag
formulahendry.code-runner
github.copilot
github.copilot-chat
lourenci.go-to-spec
mechatroner.rainbow-csv
misogi.ruby-rubocop
ms-vsliveshare.vsliveshare
ms-vsliveshare.vsliveshare-pack
oderwat.indent-rainbow
olveralan.spunbeat
pkief.material-icon-theme
rhaiscript.vscode-rhai
shopify.ruby-lsp
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
timonwong.shellcheck
vscodevim.vim
