bradgashler.htmltagwrap
bungcip.better-toml
castwide.solargraph
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
ezforo.copy-relative-path-and-line-numbers
formulahendry.auto-rename-tag
formulahendry.code-runner
GitHub.copilot
Lourenci.go-to-spec
misogi.ruby-rubocop
ms-vsliveshare.vsliveshare
ms-vsliveshare.vsliveshare-pack
oderwat.indent-rainbow
olveralan.spunbeat
PKief.material-icon-theme
rebornix.ruby
streetsidesoftware.code-spell-checker
timonwong.shellcheck
vscodevim.vim
wingrunr21.vscode-ruby
